nxp-mcuxpresso/mcux-soc-svd/MKE17Z9/MKE17Z9.xml
        <register>
          <name>FLTCTRL</name>
          <description>Fault Control</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAULT0EN</name>
              <description>Fault Input 0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULT0EN_disabled</name>
                  <description>Fault input is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT0EN_enabled</name>
                  <description>Fault input is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAULT1EN</name>
              <description>Fault Input 1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULT1EN_disabled</name>
                  <description>Fault input is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT1EN_enabled</name>
                  <description>Fault input is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAULT2EN</name>
              <description>Fault Input 2 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULT2EN_disabled</name>
                  <description>Fault input is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT2EN_enabled</name>
                  <description>Fault input is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAULT3EN</name>
              <description>Fault Input 3 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAULT3EN_disabled</name>
                  <description>Fault input is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT3EN_enabled</name>
                  <description>Fault input is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FFLTR0EN</name>
              <description>Fault Input 0 Filter Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FFLTR0EN_disabled</name>
                  <description>Fault input filter is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFLTR0EN_enabled</name>
                  <description>Fault input filter is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FFLTR1EN</name>
              <description>Fault Input 1 Filter Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FFLTR1EN_disabled</name>
                  <description>Fault input filter is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFLTR1EN_enabled</name>
                  <description>Fault input filter is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FFLTR2EN</name>
              <description>Fault Input 2 Filter Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FFLTR2EN_disabled</name>
                  <description>Fault input filter is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFLTR2EN_enabled</name>
                  <description>Fault input filter is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FFLTR3EN</name>
              <description>Fault Input 3 Filter Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FFLTR3EN_disabled</name>
                  <description>Fault input filter is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFLTR3EN_enabled</name>
                  <description>Fault input filter is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FFVAL</name>
              <description>Fault Input Filter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTATE</name>
              <description>Fault output state</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSTATE_safe</name>
                  <description>FTM outputs will be placed into safe values when fault events in ongoing (defined by POL bits).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSTATE_tristate</name>
                  <description>FTM outputs will be tri-stated when fault event is ongoing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>Configuration</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDFQ</name>
              <description>Frequency of the Reload Opportunities</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BDMMODE</name>
              <description>Debug Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GTBEEN</name>
              <description>Global Time Base Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTBEEN_disabled</name>
                  <description>Use of an external global time base is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTBEEN_enabled</name>
                  <description>Use of an external global time base is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GTBEOUT</name>
              <description>Global Time Base Output</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTBEOUT_disabled</name>
                  <description>A global time base signal generation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTBEOUT_enabled</name>
                  <description>A global time base signal generation is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITRIGR</name>
              <description>Initialization trigger on Reload Point</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITRIGR_counter</name>
                  <description>Initialization trigger is generated on counter wrap events.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITRIGR_reload</name>
                  <description>Initialization trigger is generated when a reload point is reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLTPOL</name>
          <description>FTM Fault Input Polarity</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLT0POL</name>
              <description>Fault Input 0 Polarity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLT0POL_high</name>
                  <description>The fault input polarity is active high. A 1 at the fault input indicates a fault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLT0POL_low</name>
                  <description>The fault input polarity is active low. A 0 at the fault input indicates a fault.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLT1POL</name>
              <description>Fault Input 1 Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLT1POL_high</name>
                  <description>The fault input polarity is active high. A 1 at the fault input indicates a fault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLT1POL_low</name>
                  <description>The fault input polarity is active low. A 0 at the fault input indicates a fault.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLT2POL</name>
              <description>Fault Input 2 Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLT2POL_high</name>
                  <description>The fault input polarity is active high. A 1 at the fault input indicates a fault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLT2POL_low</name>
                  <description>The fault input polarity is active low. A 0 at the fault input indicates a fault.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLT3POL</name>
              <description>Fault Input 3 Polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLT3POL_high</name>
                  <description>The fault input polarity is active high. A 1 at the fault input indicates a fault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLT2POL_low</name>
                  <description>The fault input polarity is active low. A 0 at the fault input indicates a fault.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
