nxp-mcuxpresso/mcux-soc-svd/MKE17Z9/MKE17Z9.xml
        <register>
          <name>PWMLOAD</name>
          <description>FTM PWM Load</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0SEL</name>
              <description>Channel 0 Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHSEL_reload_no</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHSEL_reload_yes</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1SEL</name>
              <description>Channel 1 Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHSEL_reload_no</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHSEL_reload_yes</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2SEL</name>
              <description>Channel 2 Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHSEL_reload_no</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHSEL_reload_yes</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3SEL</name>
              <description>Channel 3 Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHSEL_reload_no</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHSEL_reload_yes</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4SEL</name>
              <description>Channel 4 Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHSEL_reload_no</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHSEL_reload_yes</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5SEL</name>
              <description>Channel 5 Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHSEL_reload_no</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHSEL_reload_yes</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6SEL</name>
              <description>Channel 6 Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHSEL_reload_no</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHSEL_reload_yes</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7SEL</name>
              <description>Channel 7 Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHSEL_reload_no</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHSEL_reload_yes</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCSEL</name>
              <description>Half Cycle Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCSEL_disabled</name>
                  <description>Half cycle reload is disabled and it is not considered as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCSEL_enabled</name>
                  <description>Half cycle reload is enabled and it is considered as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOK</name>
              <description>Load Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDOK_disabled</name>
                  <description>Loading updated values is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOK_enabled</name>
                  <description>Loading updated values is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLEN</name>
              <description>Global Load Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLEN_disabled</name>
                  <description>Global Load Ok disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLEN_enabled</name>
                  <description>Global Load OK enabled. A pulse event on the module global load input sets the LDOK bit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLDOK</name>
              <description>Global Load OK</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLDOK_no</name>
                  <description>No action.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLDOK_yes</name>
                  <description>LDOK bit is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HCR</name>
          <description>Half Cycle Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HCVAL</name>
              <description>Half Cycle Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD_MIRROR</name>
          <description>Mirror of Modulo Value</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRACMOD</name>
              <description>Modulo Fractional Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD</name>
              <description>Mirror of the Modulo Integer Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CV_MIRROR[%s]</name>
          <description>Mirror of Channel (n) Match Value</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRACVAL</name>
              <description>Channel (n) Match Fractional Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL</name>
              <description>Mirror of the Channel (n) Match Integer Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
