nxp-mcuxpresso/mcux-soc-svd/MKE17Z9/MKE17Z9.xml
        <register>
          <name>NVICISPR</name>
          <description>Interrupt Set Pending Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SETPEND0</name>
              <description>DMA channel 0 or 4 transfer complete interrupt set-pending bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND0_0</name>
                  <description>write: no effect; read: DMA channel 0 or 4 transfer complete interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND0_1</name>
                  <description>write: changes the DMA channel 0 or 4 transfer complete interrupt state to pending; read: DMA channel 0 or 4 transfer complete interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND1</name>
              <description>DMA channel 1 or 5 transfer complete interrupt set-pending bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND1_0</name>
                  <description>write: no effect; read: DMA channel 1 or 5 transfer complete interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND1_1</name>
                  <description>write: changes the DMA channel 1 or 5 transfer complete interrupt state to pending; read: DMA channel 1 or 5 transfer complete interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND2</name>
              <description>DMA channel 2 or 6 transfer complete interrupt set-pending bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND2_0</name>
                  <description>write: no effect; read: DMA channel 2 or 6 transfer complete interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND2_1</name>
                  <description>write: changes the DMA channel 2 or 6 transfer complete interrupt state to pending; read: DMA channel 2 or 6 transfer complete interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND3</name>
              <description>DMA channel 3 or 7 transfer complete interrupt set-pending bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND3_0</name>
                  <description>write: no effect; read: DMA channel 3 or 7 transfer complete interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND3_1</name>
                  <description>write: changes the DMA channel 3 or 7 transfer complete interrupt state to pending; read: DMA channel 3 or 7 transfer complete interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND4</name>
              <description>DMA error interrupt channels 0-7 interrupt set-pending bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND4_0</name>
                  <description>write: no effect; read: DMA error interrupt channels 0-7 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND4_1</name>
                  <description>write: changes the DMA error interrupt channels 0-7 interrupt state to pending; read: DMA error interrupt channels 0-7 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND5</name>
              <description>Single interrupt vector all sources interrupt set-pending bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND5_0</name>
                  <description>write: no effect; read: Single interrupt vector all sources interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND5_1</name>
                  <description>write: changes the Single interrupt vector all sources interrupt state to pending; read: Single interrupt vector all sources interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND6</name>
              <description>Low-voltage detect, low-voltage warning interrupt set-pending bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND6_0</name>
                  <description>write: no effect; read: Low-voltage detect, low-voltage warning interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND6_1</name>
                  <description>write: changes the Low-voltage detect, low-voltage warning interrupt state to pending; read: Low-voltage detect, low-voltage warning interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND7</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND7_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND7_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND8</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND8_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND8_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND9</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND9_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND9_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND10</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND10_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND10_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND11</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND11_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND11_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND12</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND12_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND12_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND13</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND13_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND13_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND14</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND14_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND14_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND15</name>
              <description>Analog-to-Digital Converter 0 interrupt set-pending bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND15_0</name>
                  <description>write: no effect; read: Analog-to-Digital Converter 0 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND15_1</name>
                  <description>write: changes the Analog-to-Digital Converter 0 interrupt state to pending; read: Analog-to-Digital Converter 0 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND16</name>
              <description>Analog comparator 0 interrupt interrupt set-pending bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND16_0</name>
                  <description>write: no effect; read: Analog comparator 0 interrupt interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND16_1</name>
                  <description>write: changes the Analog comparator 0 interrupt interrupt state to pending; read: Analog comparator 0 interrupt interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND17</name>
              <description>FlexTimer Module 0 interrupt set-pending bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND17_0</name>
                  <description>write: no effect; read: FlexTimer Module 0 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND17_1</name>
                  <description>write: changes the FlexTimer Module 0 interrupt state to pending; read: FlexTimer Module 0 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND18</name>
              <description>FlexTimer Module 1 interrupt set-pending bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND18_0</name>
                  <description>write: no effect; read: FlexTimer Module 1 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND18_1</name>
                  <description>write: changes the FlexTimer Module 1 interrupt state to pending; read: FlexTimer Module 1 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND19</name>
              <description>FlexTimer Module 2 interrupt set-pending bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND19_0</name>
                  <description>write: no effect; read: FlexTimer Module 2 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND19_1</name>
                  <description>write: changes the FlexTimer Module 2 interrupt state to pending; read: FlexTimer Module 2 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND20</name>
              <description>Single interrupt vector all sources interrupt set-pending bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND20_0</name>
                  <description>write: no effect; read: Single interrupt vector all sources interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND20_1</name>
                  <description>write: changes the Single interrupt vector all sources interrupt state to pending; read: Single interrupt vector all sources interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND21</name>
              <description>UART0(SCI0) interrupt interrupt set-pending bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND21_0</name>
                  <description>write: no effect; read: UART0(SCI0) interrupt interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND21_1</name>
                  <description>write: changes the UART0(SCI0) interrupt interrupt state to pending; read: UART0(SCI0) interrupt interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND22</name>
              <description>Periodic timer overflow interrupt set-pending bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND22_0</name>
                  <description>write: no effect; read: Periodic timer overflow interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND22_1</name>
                  <description>write: changes the Periodic timer overflow interrupt state to pending; read: Periodic timer overflow interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND23</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND23_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND23_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
